var data = {
news : [
	{
		title: '体重测试',
		type: 'chongwubaodian-liebiao-1@2x.png',
		id:'first'
	},
	{
		title: '紧急自救',
		type: 'chongwubaodian-liebiao-2@2x.png',
		id:'second'
	},
	{
		title: '狗狗心里',
		type: 'chongwubaodian-liebiao-3@2x.png',
		id:'three'
	},
	{
		title: '宠物训练',
		type: 'chongwubaodian-liebiao-4@2x.png',
		id:'four'
	}
 ]
}
new Vue({
el: '#app',
data: data
})
// $("#first")
// $()
// $()
// $()

var weight_test = document.querySelector("#first")
weight_test.addEventListener("touchend", function(){  
     location.href="weight_test.html"; 
});
var You_Save = document.querySelector("#second")
You_Save.addEventListener("touchend", function(){  
     console.log("OK")  
}); 
var dog_heart = document.querySelector("#three")
dog_heart.addEventListener("touchend", function(){  
     console.log("OK")  
}); 
var pet_training = document.querySelector("#four")
pet_training.addEventListener("touchend", function(){  
     console.log("OK")  
}); 

//  var arr = ["边境牧羊犬","贵宾犬","德国牧羊犬","金毛猎犬","杜宾犬","喜乐蒂（谢德兰牧羊犬）","拉布拉多猎犬",  "蝴蝶犬","罗威纳","澳洲牧牛犬","威尔士柯基犬","迷你雪纳瑞","英国跳猎犬","比利时特弗伦犬",  "史其派克犬","比利史牧羊犬","苏格兰牧羊犬","德国短毛指示犬","英国可卡","标准雪纳瑞","布列塔尼猎犬",  "美国可卡","威玛猎犬","伯恩山犬","博美犬","爱尔兰水猎犬","维兹拉犬","卡迪根威尔斯科基犬",  "切萨皮克湾拾列犬","波利犬","约克夏","巨型雪纳瑞","万能梗","伯瑞犬","威尔斯跳猎犬",  "曼彻斯特梗","萨摩耶犬","纽芬兰犬","澳洲梗","美国斯塔福郡梗","戈登蹲猎犬","长须牧羊犬",  "凯恩埂","凯利蓝梗","爱尔兰梗","挪威猎糜犬","猴面梗","丝毛梗","迷你品犬",  "法老王猎犬","克伦伯长毛垂耳猎犬","洛威梗","大麦町","贝灵顿梗","爱尔兰猎狼犬","库瓦兹犬",  "萨路基猎犬","骑士查里王猎犬","德国刚毛指示犬","西伯利亚雪撬犬（哈士奇）","比熊犬", "英国猎狐犬","美国猎狐犬","格里芬犬","西高地白梗","拳师狗","大丹狗","腊肠狗",  "阿拉斯加雪撬犬","沙皮狗","罗德西亚背脊犬","爱尔兰梗","波斯顿梗","秋田狗","斯凯梗",  "西里罕梗","巴哥犬","法国斗牛犬","马尔济斯犬","藏獒","灵缇","英国猎狐犬",  "美国猎狐犬","格里芬犬","意大利灵缇","中国冠毛犬","丹迪丁蒙梗","西藏梗","英国老式牧羊犬",  "比利牛斯山犬","圣伯纳犬","苏格兰梗","牛头梗","吉娃娃","拉萨犬","斗牛獒犬","西施犬","巴吉度猎犬","獒犬","比高犬",  "北京犬","血缇","苏俄牧羊犬","松狮犬","英国斗牛犬","贝生吉犬","阿富汗猎犬"]; 
// document.write(arr+"<br/>"); 
// arr.sort(function(a,b){ 
// return a.localeCompare(b); 
// }); 
// console.log(arr);
var arr = ["边境牧羊犬","贵宾犬","德国牧羊犬","金毛猎犬","杜宾犬","喜乐蒂（谢德兰牧羊犬）","拉布拉多猎犬",  "蝴蝶犬","罗威纳","澳洲牧牛犬","威尔士柯基犬","迷你雪纳瑞","英国跳猎犬","比利时特弗伦犬",  "史其派克犬","比利史牧羊犬","苏格兰牧羊犬","德国短毛指示犬","英国可卡","标准雪纳瑞","布列塔尼猎犬",  "美国可卡","威玛猎犬","伯恩山犬","博美犬","爱尔兰水猎犬","维兹拉犬","卡迪根威尔斯科基犬",  "切萨皮克湾拾列犬","波利犬","约克夏","巨型雪纳瑞","万能梗","伯瑞犬","威尔斯跳猎犬",  "曼彻斯特梗","萨摩耶犬","纽芬兰犬","澳洲梗","美国斯塔福郡梗","戈登蹲猎犬","长须牧羊犬","凯恩埂","凯利蓝梗","爱尔兰梗","挪威猎糜犬","猴面梗","丝毛梗","迷你品犬",  "法老王猎犬","克伦伯长毛垂耳猎犬","洛威梗","大麦町","贝灵顿梗","爱尔兰猎狼犬","库瓦兹犬",  "萨路基猎犬","骑士查里王猎犬","德国刚毛指示犬","西伯利亚雪撬犬（哈士奇）","比熊犬", "英国猎狐犬","美国猎狐犬","格里芬犬","西高地白梗","拳师狗","大丹狗","腊肠狗",  "阿拉斯加雪撬犬","沙皮狗","罗德西亚背脊犬","爱尔兰梗","波斯顿梗","秋田狗","斯凯梗",  "西里罕梗","巴哥犬","法国斗牛犬","马尔济斯犬","藏獒","灵缇","英国猎狐犬",  "美国猎狐犬","格里芬犬","意大利灵缇","中国冠毛犬","丹迪丁蒙梗","西藏梗","英国老式牧羊犬",  "比利牛斯山犬","圣伯纳犬","苏格兰梗","牛头梗","吉娃娃","拉萨犬","斗牛獒犬","西施犬","巴吉度猎犬","獒犬","比高犬",  "北京犬","血缇","苏俄牧羊犬","松狮犬","英国斗牛犬","贝生吉犬","阿富汗猎犬"];
  document.write(arr+""); 
    arr.sort(function(a,b){ 
    return a.localeCompare(b); 
}); 
console.log(arr);


	// var a ="边境牧羊犬,贵宾犬,德国牧羊犬,金毛猎犬,杜宾犬,喜乐蒂（谢德兰牧羊犬）,拉布拉多猎犬,  蝴蝶犬,罗威纳,澳洲牧牛犬,威尔士柯基犬,迷你雪纳瑞,英国跳猎犬,比利时特弗伦犬,史其派克犬,比利史牧羊犬,苏格兰牧羊犬,德国短毛指示犬,英国可卡,标准雪纳瑞,布列塔尼猎犬,  美国可卡,威玛猎犬,伯恩山犬,博美犬,爱尔兰水猎犬,维兹拉犬,卡迪根威尔斯科基犬,  切萨皮克湾拾列犬,波利犬,约克夏,巨型雪纳瑞,万能梗,伯瑞犬,威尔斯跳猎犬,  曼彻斯特梗,萨摩耶犬,纽芬兰犬,澳洲梗,美国斯塔福郡梗,戈登蹲猎犬,长须牧羊犬,  凯恩埂,凯利蓝梗,爱尔兰梗,挪威猎糜犬,猴面梗,丝毛梗,迷你品犬,  法老王猎犬,克伦伯长毛垂耳猎犬,洛威梗,大麦町,贝灵顿梗,爱尔兰猎狼犬,库瓦兹犬,  萨路基猎犬,骑士查里王猎犬,德国刚毛指示犬,西伯利亚雪撬犬（哈士奇）,比熊犬, 英国猎狐犬,美国猎狐犬,格里芬犬,西高地白梗,拳师狗,大丹狗,腊肠狗,  阿拉斯加雪撬犬,沙皮狗,罗德西亚背脊犬,爱尔兰梗,波斯顿梗,秋田狗,斯凯梗,  西里罕梗,巴哥犬,法国斗牛犬,马尔济斯犬,藏獒,灵缇,英国猎狐犬,  美国猎狐犬,格里芬犬,意大利灵缇,中国冠毛犬,丹迪丁蒙梗,西藏梗,英国老式牧羊犬,  比利牛斯山犬,圣伯纳犬,苏格兰梗,牛头梗,吉娃娃,拉萨犬,斗牛獒犬,西施犬,巴吉度猎犬,獒犬,比高犬,  北京犬,血缇,苏俄牧羊犬,松狮犬,英国斗牛犬,贝生吉犬,阿富汗猎犬"
         
 //          a=a.split(',')
 //          a.sort();
 //          console.log(a);
 //          a.sort(function(a,b){return a.localeCompare(b)});//汉字拼音排序方法
          
 

